КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЛ_Титул1_5_02/КонтурЛогистика_ПЛ_Титул1_5_02.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ПЛ_Титул1_5_02</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>УИД_ПЛ</name>
    <comment>(из пула!) Выдается ГИС ЭПД Уникальный идентификатор документа путевого листа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфСоб</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфСоб</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЛицоОформившееПЛ</name>
    <comment>Сведения о лице, оформившем путевой лист</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерПЛ</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаПЛ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОбязМедосмотрПосле</name>
    <comment>Признак обязательности проведения послесменного, послерейсового медицинского осмотра</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПеревозки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ВидыПеревозки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидКоммерческойПеревозки</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ВидыКоммерческихПеревозок</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидСообщения</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ВидыПутейСообщений</types>
    </type>
  </attributes>
  <attributes>
    <name>СрокПЛ</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СрокПЛИнтервал</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель2</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ТранспортноеСредство</name>
    <comment>Транспортное средство на котором начинает исполняться перевозки</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп</name>
    <comment>Обязателен если тип основного транспортного средства - тягач</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>Прицеп2</name>
    <comment>Второй прицеп автопоезда</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ТранспортныеСредства</types>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>для себя, не отправим в документе</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОрганизацияМедик</name>
    <comment>пусто >> равен ЛицоОформившееПЛ</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
    </type>
  </attributes>
  <attributes>
    <name>kl_id</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодпис</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпосПодтПолном</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ХешСуммаQRКода</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтказВПодписи</name>
    <comment>признак отказа в подписи</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаВПодписи</name>
    <comment>текст содержащий причину отказа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторыЕГАИС</name>
    <comment>Список идентификаторов ЕГАИС с разделителем ;</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ТестовыйДокумент</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Разделитель</name>
    <type>
      <types>DefinedType.КонтурЛогистика_РазделительДокументаУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСведенияОПодписанте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьТ2Сразу</name>
    <comment>Если требуется создать и подписать сразу титул 2, то необходимо заполнить реквизиты с префиксом &quot;ДанныеТ2&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ2МедРаботник</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ2МедЛицензия</name>
    <comment>Лицензия на осущ. мед. деятельности</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Лицензии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ2Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ2ДатВрПрМО</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ2ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ2ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ФормироватьТ3Сразу</name>
    <comment>Если требуется создать и подписать сразу титул 2, то необходимо заполнить реквизиты с префиксом &quot;ДанныеТ3&quot;</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3ТехРаботник</name>
    <comment>Сведения о должностном лице, ответственном за техническое состояние и безопасную эксплуатацию транспортного средства</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3ДатВрКонтТехСост</name>
    <comment>Дата и время контроля технического состояния</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3ДатВрВыпНаЛин</name>
    <comment>Дата и время выпуска транспортного средства на линию</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3ПоказанияОдометра</name>
    <comment>Показания одометра</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ДанныеТ3ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ПартнерМедик</name>
    <comment>надсущность над контрагентами, например, ТС Магнит или ТК Монополия</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Партнеры</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеВодители</name>
    <attributes>
      <name>Водитель</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеПолучателиФайла</name>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>T(1-2000)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СведенияГосСистем</name>
    <attributes>
      <name>НаимГосСист</name>
      <comment>Наименование государственной информационной системы</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>УчетЕд</name>
      <comment>Учетная единица в государственной информационной системе</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИнаяИнф</name>
      <comment>Иная информация о товаре, подлежащем учету в государственной информационной системе</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>1000</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдНомУчетЕд</name>
      <comment>Идентификационный номер учетной единицы в государственной информационной системе</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СпецУслДвиж</name>
    <attributes>
      <name>СпецУсл</name>
      <type>
        <types>EnumRef.КонтурЛогистика_СпециальныеУсловияДвижения</types>
      </type>
    </attributes>
    <attributes>
      <name>НомСР</name>
      <comment>Номер специального разрешения, иного разрешительного документа</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДатаСР</name>
      <comment>Дата специального разрешения, иного разрешительного документа</comment>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СрокСР</name>
      <comment>Срок действия специального разрешения, иного разрешительного документа</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидСР</name>
      <comment>Вид специального разрешения, иного разрешительного документа</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НаимОИВ</name>
      <comment>Краткое наименование органа исполнительной власти (специализированной уполномоченной организации), выдавшего документ</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдСР</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СведМрш_МршТекст</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>СведМрш_МршМашЧит</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЛ_Титул1_5_02/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	
	КонтурЛогистика_ОбработкаДокументовСервер.ОбработкаПолученияПредставленияДокументаТитулаПЛ(Данные, Представление, СтандартнаяОбработка, "1");
	
КонецПроцедуры

#КонецОбласти

#Область ПроверкаЗаполнения

Функция ПроверитьДокумент(Знач ДокументОбъектИлиСсылка, ТаблицаОшибок = Неопределено, ПараметрыФормированияФайлов = Неопределено) Экспорт
	
	Если ТаблицаОшибок = Неопределено Тогда
		ТаблицаОшибок = КонтурЛогистика_ПанельОшибокСервер.ИнициализироватьТаблицуОшибок();
	КонецЕсли;
	
	ТекСтатусТитула = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(ДокументОбъектИлиСсылка.Ссылка, Истина);
	
	ТаблицаОшибок.Очистить();
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда
		КонтурЛогистика_ПанельОшибокСервер.ВывестиОшибкуТекущегоТитула(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок)
	КонецЕсли;
	
	Если ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.Получен 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученТребуетОбработки 
		Или ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.ПолученОбработанСПредупреждением Тогда
		
		// TODO понять какие сценарии проверки входящего документа
		
	ИначеЕсли Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена 
		И Не ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершенаРаспечатан Тогда  
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьДиадокОшибки(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбщегоНазначенияСервер.ВалидацияВыполненияАвторизации(ДокументОбъектИлиСсылка,
			Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02, ТаблицаОшибок);
		
		ПроверитьШапку(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		ПроверитьСпецУсловия(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		ПроверитьУчетВГосСист(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		ПроверитьИнфПол(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		Если ДокументОбъектИлиСсылка.ФормироватьТ2Сразу Или ДокументОбъектИлиСсылка.ФормироватьТ3Сразу Тогда 
			ПроверитьСквознойСценарий(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		КонецЕсли;
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьПодписанта(
			ДокументОбъектИлиСсылка, ТаблицаОшибок,, ПараметрыФормированияФайлов);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьДружбуКонтрагентов(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		ПроверитьАктивныйПредыдущийЭПЛ(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
		КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьОтправителя(ДокументОбъектИлиСсылка, ТаблицаОшибок);
		
	ИначеЕсли ТекСтатусТитула = Перечисления.КонтурЛогистика_СтатусыТитулов.РаботаЗавершена Тогда 
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьПредупреждения(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
		КонтурЛогистика_ПанельОшибокСервер.ПроверитьОшибкиДругихСторон(ДокументОбъектИлиСсылка.Ссылка, ТаблицаОшибок);
		
	КонецЕсли;
	
	КонтурЛогистика_ОбработкаДокументовСервер.Валидатор_ПроверитьРоуминг(ДокументОбъектИлиСсылка, ТаблицаОшибок);
	
	Результат = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат Результат;
	
КонецФункции

Процедура ПроверитьШапку(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КатегорияПредупреждение = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	
	ПараметрыСервиса = КонтурЛогистика_ИнтеграцияAPI_ЛогистикаПовтИсп.ПараметрыСервисаЛогистика(Объект.ЛицоОформившееПЛ);
	Если Не ПараметрыСервиса.АвторизацияВыполнена И ЗначениеЗаполнено(Объект.ЛицоОформившееПЛ) Тогда
		
		ОстатокУИДов = РегистрыСведений.КонтурЛогистика_УИДыГИС.ОсталосьСвободныхУИДов(Объект.ЛицоОформившееПЛ);
		УИДПЛПустой = РегистрыСведений.КонтурЛогистика_УИДыГИС.ЭтоПустойУИД(Объект.УИД_ПЛ);
		
		Если ОстатокУИДов = 0 Тогда
			
			КатегорияОшибкиПула = КатегорияОшибка;
			Если Не УИДПЛПустой Тогда
				КатегорияОшибкиПула = КатегорияПредупреждение;
			КонецЕсли;
			
			ТекстОшибки = "Не осталось свободных УИД в пуле. Получите новые.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"УИД_ПЛ", КатегорияОшибкиПула, ТекстОшибки, "Получить УИДы");
			
		КонецЕсли;
		
		Если ОстатокУИДов > 0 И УИДПЛПустой Тогда 
			
			ТекстОшибки = "УИД будет взят из пула (при подписании)";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"УИД_ПЛ", КатегорияПредупреждение, ТекстОшибки, "");
			
		КонецЕсли;
		
	КонецЕсли;
	
	Если Не РегистрыСведений.КонтурЛогистика_УИДыГИС.ЭтоПустойУИД(Объект.УИД_ПЛ)
		И РегистрыСведений.КонтурЛогистика_УИДыГИС.УИДИстек(Объект.УИД_ПЛ, Объект.ЛицоОформившееПЛ) Тогда
		
		ТекстОшибки = "Срок использования УИД истек, необходимо указать новый УИД.";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"УИД_ПЛ", КатегорияОшибка, ТекстОшибки, "Очистить УИД");
		
	КонецЕсли;

	Для Каждого ОбязательныйРевизит Из МассивОбязательныхРеквизитов() Цикл
		
		Если Прав(ОбязательныйРевизит, 6) = "Массив" ИЛИ Прав(ОбязательныйРевизит, 14) = "МассивСтруктур" Тогда 
			Продолжить;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(Объект[ОбязательныйРевизит]) Тогда
			
			ОбязательныйРевизитСиноним = Документы.КонтурЛогистика_ПЛ_Титул1_5_02.СинонимРеквизита(ОбязательныйРевизит);
			ТекстОшибки = "Укажите " + ОбязательныйРевизитСиноним;
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ОбязательныйРевизит, КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
	КонецЦикла;
	
	Если Объект.ВидПеревозки = Перечисления.КонтурЛогистика_ВидыПеревозки.КП Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ВидКоммерческойПеревозки) Тогда 
			
			ТекстОшибки = "Не указан вид коммерческой перевозки";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ВидКоммерческойПеревозки", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
						
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.ЛицоОформившееПЛ) Тогда
		
		Если Объект.ЛицоОформившееПЛ.ТипЛица = Перечисления.КонтурЛогистика_ТипыЛиц.ФизЛицо
			И Объект.ВидКоммерческойПеревозки <> Перечисления.КонтурЛогистика_ВидыКоммерческихПеревозок.ЛТ Тогда
			
			ТекстОшибки = "Для выбранного вида перевозки недоступно оформление для физ. лица";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ВидКоммерческойПеревозки", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Объект.ЛицоОформившееПЛ.ТипЛица = Перечисления.КонтурЛогистика_ТипыЛиц.ЮрЛицо Тогда
			
			Если Не ЗначениеЗаполнено(Объект.ЛицоОформившееПЛ.НаименованиеОрганизацииПолное) Тогда
				
				ТекстОшибки = "Укажите полное наименование организации оформляющей путевой лист";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ЛицоОформившееПЛ.НаименованиеОрганизацииПолное", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Объект.ЛицоОформившееПЛ.ОГРН) Тогда
				
				ТекстОшибки = "УкажитеОГРН организации оформляющей путевой лист";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ЛицоОформившееПЛ.ОГРН", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
		ИначеЕсли Объект.ЛицоОформившееПЛ.ТипЛица = Перечисления.КонтурЛогистика_ТипыЛиц.ИП Тогда
			
			Если Не ЗначениеЗаполнено(Объект.ЛицоОформившееПЛ.ОГРН) Тогда
				
				ТекстОшибки = "Укажите ОГРНИП ИП оформляющего путевой лист";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ЛицоОформившееПЛ.ОГРНИП", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Объект.ЛицоОформившееПЛ.Фамилия) Тогда
				
				ТекстОшибки = "Укажите фамилию ИП оформляющего путевой лист";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ЛицоОформившееПЛ.Фамилия", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Объект.ЛицоОформившееПЛ.Имя) Тогда
				
				ТекстОшибки = "Укажите имя ИП оформляющего путевой лист";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ЛицоОформившееПЛ.Имя", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
		ИначеЕсли Объект.ЛицоОформившееПЛ.ТипЛица = Перечисления.КонтурЛогистика_ТипыЛиц.ФизЛицо Тогда
			
			Если Не ЗначениеЗаполнено(Объект.ЛицоОформившееПЛ.ИНН) Тогда
				
				ТекстОшибки = "Укажите ИНН физ. лица оформляющего путевой лист";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ЛицоОформившееПЛ.ИНН", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Объект.ЛицоОформившееПЛ.Фамилия) Тогда
				
				ТекстОшибки = "Укажите фамилию физ. лица оформляющего путевой лист";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ЛицоОформившееПЛ.Фамилия", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(Объект.ЛицоОформившееПЛ.Имя) Тогда
				
				ТекстОшибки = "Укажите имя физ. лица оформляющего путевой лист";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ЛицоОформившееПЛ.Имя", КатегорияОшибка, ТекстОшибки, "Указать");
				
			КонецЕсли;
			
		КонецЕсли;		
		
	КонецЕсли;
	
	Если Не Справочники.КонтурЛогистика_ОрганизацииДиадок.ТелефонЗаполнен(Объект.ЛицоОформившееПЛ) Тогда		
		
		ТекстОшибки = "Укажите телефон организации оформляющей путевой лист";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"ЛицоОформившееПЛ.ТелефонОсновной", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
			
	//ТС
	
	Если ЗначениеЗаполнено(Объект.ТранспортноеСредство) Тогда
		
		Если Не ЗначениеЗаполнено(Объект.ТранспортноеСредство.ТипТСПоКлассификатору) Тогда
			
			ТекстОшибки = "Укажите тип ТС";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ТранспортноеСредство.ТипТСПоКлассификатору", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Объект.ТранспортноеСредство.ТипТСПоКлассификатору = Перечисления.КонтурЛогистика_ТипыТранспортныхСредств.Иной
			И Не ЗначениеЗаполнено(Объект.ТранспортноеСредство.ИнойТипТС) Тогда
			
			ТекстОшибки = "Укажите иной тип ТС";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ТранспортноеСредство.ИнойТипТС", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ТранспортноеСредство.МаркаТС) Тогда
			
			ТекстОшибки = "Укажите марку ТС";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ТранспортноеСредство.МаркаТС", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ТранспортноеСредство.МодельТС) Тогда
			
			ТекстОшибки = "Укажите модель ТС";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ТранспортноеСредство.МодельТС", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ТранспортноеСредство.РегНомер) 
			И Не ЗначениеЗаполнено(Объект.ТранспортноеСредство.ИнвНомер) Тогда
			
			ТекстОшибки = "Укажите гос. рег. номер или инв. номер ТС";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ТранспортноеСредство.РегНомер", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ТранспортноеСредство.ВидВладения) Тогда
			
			ТекстОшибки = "Укажите вид владения ТС";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ТранспортноеСредство.ВидВладения", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(Объект.ТранспортноеСредство.АрендодательЛизингодатель)
			И (Объект.ТранспортноеСредство.ВидВладения = Перечисления.КонтурЛогистика_ВидыВладенияТранспортнымСредством.Аренда_3
				Или Объект.ТранспортноеСредство.ВидВладения = Перечисления.КонтурЛогистика_ВидыВладенияТранспортнымСредством.Лизинг_4) Тогда
			
			ТекстОшибки = "Не указан владелец ТС - По умолчанию считаем что оформитель ПЛ и есть собственник.";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
				"ТранспортноеСредство.АрендодательЛизингодатель", КатегорияПредупреждение, ТекстОшибки, "Внимание");
			
		КонецЕсли;
		
		Если Объект.ТранспортноеСредство.ВидВладения = Перечисления.КонтурЛогистика_ВидыВладенияТранспортнымСредством.Аренда_3
			Или Объект.ТранспортноеСредство.ВидВладения = Перечисления.КонтурЛогистика_ВидыВладенияТранспортнымСредством.Лизинг_4
			Или Объект.ТранспортноеСредство.ВидВладения = Перечисления.КонтурЛогистика_ВидыВладенияТранспортнымСредством.БезвозмездноеПользование_5 Тогда
			
			Если Не ЗначениеЗаполнено(Объект.ТранспортноеСредство.ДоговорАрендаЛизинг) Тогда
			
				ТекстОшибки = "Укажите договор аренды ТС";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
					"ТранспортноеСредство.ДоговорАрендаЛизинг", КатегорияОшибка, ТекстОшибки, "Указать");
				
			Иначе
				
				Если Не ЗначениеЗаполнено(Объект.ТранспортноеСредство.ДоговорАрендаЛизинг.Наименование) Тогда
			
					ТекстОшибки = "Укажите наименование договор аренды ТС";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"ТранспортноеСредство.ДоговорАрендаЛизинг.Наименование", КатегорияОшибка, ТекстОшибки, "Указать");
				
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Объект.ТранспортноеСредство.ДоговорАрендаЛизинг.НомерДокумента) Тогда
			
					ТекстОшибки = "Укажите номер договора аренды ТС";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"ТранспортноеСредство.ДоговорАрендаЛизинг.НомерДокумента", КатегорияОшибка, ТекстОшибки, "Указать");
				
				КонецЕсли;
				
				Если Не ЗначениеЗаполнено(Объект.ТранспортноеСредство.ДоговорАрендаЛизинг.ДатаДокумента) Тогда
			
					ТекстОшибки = "Укажите дата договора аренды ТС";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
						"ТранспортноеСредство.ДоговорАрендаЛизинг.ДатаДокумента", КатегорияОшибка, ТекстОшибки, "Указать");
				
				КонецЕсли;
				
			КонецЕсли;
			
		КонецЕсли;
						
	КонецЕсли;
	
	// Прицепы
	ПроверитьПрицеп(Объект.Прицеп, ТаблицаОшибок, КатегорияОшибка, "Прицеп");
	ПроверитьПрицеп(Объект.Прицеп2, ТаблицаОшибок, КатегорияОшибка, "Прицеп2");
	
	// Водитель1 и 2
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьВодителя(Объект.Водитель, ТаблицаОшибок, КатегорияОшибка,, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02, Объект);
	
	Если ЗначениеЗаполнено(Объект.Водитель2) Тогда 
		КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьВодителя(Объект.Водитель2, ТаблицаОшибок, КатегорияОшибка, "2", Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02, Объект);
	КонецЕсли;
	
	// ДополнительныеВодители
	Для Каждого Строка Из Объект.ДополнительныеВодители Цикл		
		КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьВодителя(Строка.Водитель, ТаблицаОшибок, КатегорияОшибка, Строка, Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02, Объект);		
	КонецЦикла;
			
	Если ЗначениеЗаполнено(Объект.СрокПЛИнтервал) И Объект.СрокПЛИнтервал < Объект.СрокПЛ Тогда 
		
		ТекстОшибки = "Окончание срока ПЛ должно быть позже его начала";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		"СрокПЛИнтервал", КатегорияОшибка, ТекстОшибки, "Исправить");
		
	КонецЕсли;
	
	// TODO
	// ГЛУБОКИЕ ВАЛИДАЦИИ, ВЗАИМНЫЕ ВАЛИДАЦИИ
	
КонецПроцедуры

Процедура ПроверитьПрицеп(Прицеп, ТаблицаОшибок, КатегорияОшибка, ИмяПоля)
	
	Если Не ЗначениеЗаполнено(Прицеп) Тогда
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Прицеп.МаркаТС) Тогда
		
		ТекстОшибки = "Укажите марку прицепа";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ИмяПоля + ".МаркаТС", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Прицеп.МодельТС) Тогда
		
		ТекстОшибки = "Укажите модель прицепа";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ИмяПоля + ".МодельТС", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Прицеп.РегНомер) Тогда
		
		ТекстОшибки = "Укажите гос. рег. номер прицепа";
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			ИмяПоля + ".РегНомер", КатегорияОшибка, ТекстОшибки, "Указать");
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ПроверитьАктивныйПредыдущийЭПЛ(Знач Объект, ТаблицаОшибок) Экспорт
	
	ЗначениеНастройкиКонтроля = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки("КонтрольЕстьАктивныйПЛ");
	
	Если Не ЗначениеЗаполнено(ЗначениеНастройкиКонтроля)
		Или ЗначениеНастройкиКонтроля = Перечисления.КонтурЛогистика_ВариантыВалидации.НеПроверять Тогда 
		
		Возврат; // не включено
		
	КонецЕсли;
	
	Если ЗначениеНастройкиКонтроля = Перечисления.КонтурЛогистика_ВариантыВалидации.Предупреждать Тогда
		КатегорияОшибкиОбъекта = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Предупреждение;
	Иначе 
		КатегорияОшибкиОбъекта = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	КонецЕсли;
	
	
	Водитель1 	= Объект.Водитель;
	Водитель2	= Объект.Водитель2;
	ТС 			= Объект.ТранспортноеСредство;
	Прицеп 		= Объект.Прицеп;
	
	ДатаПЛ 		= Объект.ДатаПЛ;	
	Если Не ЗначениеЗаполнено(ДатаПЛ) 
		Или НачалоДня(ДатаПЛ) = НачалоДня(ТекущаяДата()) Тогда 
		ДатаПЛ = ТекущаяДата();
	КонецЕсли;
	
	СрокПЛ		= Объект.СрокПЛ;
	Если Не ЗначениеЗаполнено(СрокПЛ) Тогда 
		СрокПЛ = ТекущаяДата();
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	КонтурЛогистика_ПЛ_Титул1.Ссылка КАК Ссылка,
	               |	КонтурЛогистика_ПЛ_Титул1.Водитель КАК Водитель,
	               |	КонтурЛогистика_ПЛ_Титул1.Водитель2 КАК Водитель2,
	               |	КонтурЛогистика_ПЛ_Титул1.ТранспортноеСредство КАК ТранспортноеСредство,
	               |	КонтурЛогистика_ПЛ_Титул1.Прицеп КАК Прицеп,
	               |	КонтурЛогистика_ПЛ_Титул1.СрокПЛ КАК СрокПЛ,
	               |	КонтурЛогистика_ПЛ_Титул1.СрокПЛИнтервал КАК СрокПЛИнтервал
	               |ПОМЕСТИТЬ ВТ_СвежиеПЛ
	               |ИЗ
	               |	Документ.КонтурЛогистика_ПЛ_Титул1_5_02 КАК КонтурЛогистика_ПЛ_Титул1
	               |ГДЕ
	               |	КонтурЛогистика_ПЛ_Титул1.ДатаПЛ >= &Дата30Дней
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_СвежиеПЛ.Ссылка КАК Ссылка,
	               |	ВТ_СвежиеПЛ.Водитель КАК Водитель,
	               |	ВТ_СвежиеПЛ.Водитель2 КАК Водитель2,
	               |	ВТ_СвежиеПЛ.ТранспортноеСредство КАК ТранспортноеСредство,
	               |	ВТ_СвежиеПЛ.Прицеп КАК Прицеп,
	               |	ВТ_СвежиеПЛ.СрокПЛ КАК СрокПЛ,
	               |	ВТ_СвежиеПЛ.СрокПЛИнтервал КАК СрокПЛИнтервал
	               |ПОМЕСТИТЬ ВТ_АктивныеСвежиеПЛ
	               |ИЗ
	               |	ВТ_СвежиеПЛ КАК ВТ_СвежиеПЛ
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтурЛогистика_ДвижениеДокументооборота.СрезПоследних(, ) КАК КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних
	               |		ПО ВТ_СвежиеПЛ.Ссылка = КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Документ
	               |ГДЕ
	               |	КонтурЛогистика_ДвижениеДокументооборотаСрезПоследних.Состояние = &СостояниеВПути
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |УНИЧТОЖИТЬ ВТ_СвежиеПЛ
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_АктивныеСвежиеПЛ.Ссылка КАК Ссылка,
	               |	ВТ_АктивныеСвежиеПЛ.Водитель КАК Водитель,
	               |	ВТ_АктивныеСвежиеПЛ.Водитель2 КАК Водитель2,
	               |	ВТ_АктивныеСвежиеПЛ.ТранспортноеСредство КАК ТранспортноеСредство,
	               |	ВТ_АктивныеСвежиеПЛ.Прицеп КАК Прицеп,
	               |	ВТ_АктивныеСвежиеПЛ.СрокПЛ КАК СрокПЛ,
	               |	ВТ_АктивныеСвежиеПЛ.СрокПЛИнтервал КАК СрокПЛИнтервал
	               |ИЗ
	               |	ВТ_АктивныеСвежиеПЛ КАК ВТ_АктивныеСвежиеПЛ
	               |ГДЕ
	               |	(ВТ_АктивныеСвежиеПЛ.Водитель = &Водитель
	               |				И ВТ_АктивныеСвежиеПЛ.Водитель <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Сотрудники.ПустаяСсылка)
	               |			ИЛИ ВТ_АктивныеСвежиеПЛ.Водитель = &Водитель2
	               |				И ВТ_АктивныеСвежиеПЛ.Водитель <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Сотрудники.ПустаяСсылка)
	               |			ИЛИ ВТ_АктивныеСвежиеПЛ.Водитель2 = &Водитель
	               |				И ВТ_АктивныеСвежиеПЛ.Водитель2 <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Сотрудники.ПустаяСсылка)
	               |			ИЛИ ВТ_АктивныеСвежиеПЛ.Водитель2 = &Водитель2
	               |				И ВТ_АктивныеСвежиеПЛ.Водитель2 <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_Сотрудники.ПустаяСсылка)
	               |			ИЛИ ВТ_АктивныеСвежиеПЛ.ТранспортноеСредство = &ТС
	               |				И ВТ_АктивныеСвежиеПЛ.ТранспортноеСредство <> ЗНАЧЕНИЕ(Справочник.КонтурЛогистика_ТранспортныеСредства.ПустаяСсылка))
	               |	И (ВТ_АктивныеСвежиеПЛ.СрокПЛ = &СрокПЛ
	               |			ИЛИ &СрокПЛ МЕЖДУ ВТ_АктивныеСвежиеПЛ.СрокПЛ И ВТ_АктивныеСвежиеПЛ.СрокПЛИнтервал)";
	
	Запрос.УстановитьПараметр("ДатаЭПЛ", ДатаПЛ);
	Запрос.УстановитьПараметр("Дата30Дней", ДатаПЛ - 2592000); // минус 30 суток
	Запрос.УстановитьПараметр("Водитель", Водитель1);
	Запрос.УстановитьПараметр("Водитель2", Водитель2);
	Запрос.УстановитьПараметр("ТС", ТС);
	Запрос.УстановитьПараметр("СрокПЛ", СрокПЛ);
	Запрос.УстановитьПараметр("СостояниеВПути", Справочники.КонтурЛогистика_СостоянияДвиженияДокументооборота.НайтиСостояниеДОПоКоду("pl-on-the-way"));
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		                                                                                 
		ТекстОшибки = "Уже есть активный ЭПЛ: " + Выборка.Ссылка + " (включена проверка): " + Символы.ПС
		+ Выборка.Водитель + ?(ЗначениеЗаполнено(Выборка.Водитель2), " " + Выборка.Водитель2 ,"") + ", " + Символы.ПС 
		+ Выборка.ТранспортноеСредство + ", " + Символы.ПС
		+ ?(ЗначениеЗаполнено(Выборка.СрокПЛИнтервал),
			"интервал действия с " + Формат(Выборка.СрокПЛ, "ДФ=dd.MM.yyyy") + " по " + Формат(Выборка.СрокПЛИнтервал, "ДФ=dd.MM.yyyy"),
			"действует " + Формат(Выборка.СрокПЛ, "ДФ=dd.MM.yyyy"));
		
		КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
		"" , КатегорияОшибкиОбъекта, ТекстОшибки, "Проверить");
		
		Если Выборка.Количество() > 1 Тогда
			
			ЕщеПЛ = Выборка.Количество() - 1;
			ТекстОшибки = "Есть еще " + ЕщеПЛ + " активных путевых листов с таким же Водителем/ТС/Прицепом (включена проверка)";			
			
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "", 
			"" , КатегорияОшибкиОбъекта, ТекстОшибки, "Проверить");
			
			Прервать;
			
		КонецЕсли;
		
	
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьИнфПол(Знач Объект, ТаблицаОшибок)
	
	СтуктураПроверки = Новый Структура;
	СтуктураПроверки.Вставить("ИнфПол", "");
		
	КонтурЛогистика_ОбработкаДокументовСервер.ПроверитьИнфПолСИдФайл(Объект, СтуктураПроверки, ТаблицаОшибок);	
	
КонецПроцедуры

Процедура ПроверитьСпецУсловия(Знач Объект, ТаблицаОшибок)
	
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	
	Для Каждого СпецУсл Из Объект.СпецУслДвиж Цикл
		
		Если Не ЗначениеЗаполнено(СпецУсл.СпецУсл) Тогда
				
			ТекстОшибки = "Укажите спец. условие";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "СпецУслДвиж", СпецУсл.НомерСтроки, 
				"СпецУсл", КатегорияОшибка, ТекстОшибки, "Указать");
					
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СпецУсл.ИдСР) Тогда
			
			Если Не ЗначениеЗаполнено(СпецУсл.НомСР) Тогда
				
				ТекстОшибки = "Укажите номер спец. разрешения";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "СпецУслДвиж", СпецУсл.НомерСтроки, 
					"НомСР", КатегорияОшибка, ТекстОшибки, "Указать");
					
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СпецУсл.ДатаСР) Тогда
				
				ТекстОшибки = "Укажите дату спец. разрешения";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "СпецУслДвиж", СпецУсл.НомерСтроки, 
					"ДатаСР", КатегорияОшибка, ТекстОшибки, "Указать");
					
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СпецУсл.СрокСР) Тогда
				
				ТекстОшибки = "Укажите срок спец. разрешения";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "СпецУслДвиж", СпецУсл.НомерСтроки, 
					"СрокСР", КатегорияОшибка, ТекстОшибки, "Указать");
					
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СпецУсл.ВидСР) Тогда
				
				ТекстОшибки = "Укажите вид спец. разрешения";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "СпецУслДвиж", СпецУсл.НомерСтроки, 
					"ВидСР", КатегорияОшибка, ТекстОшибки, "Указать");
					
			КонецЕсли;
			
			Если Не ЗначениеЗаполнено(СпецУсл.НаимОИВ) Тогда
				
				ТекстОшибки = "Укажите наименование органа испол. власти";
				КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "СпецУслДвиж", СпецУсл.НомерСтроки, 
					"НаимОИВ", КатегорияОшибка, ТекстОшибки, "Указать");
					
			КонецЕсли;
		
		КонецЕсли;	
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьУчетВГосСист(Знач Объект, ТаблицаОшибок)
		
	КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
	
	Для Каждого СтрГосСист Из Объект.СведенияГосСистем Цикл
		
		Если Не ЗначениеЗаполнено(СтрГосСист.НаимГосСист) Тогда
			
			ТекстОшибки = "Укажите наименование гос. информ. системы";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "СведенияГосСистем", СтрГосСист.НомерСтроки, 
				"НаимГосСист", КатегорияОшибка, ТекстОшибки, "Указать");
				
		КонецЕсли;
		
		Если Не ЗначениеЗаполнено(СтрГосСист.ИдНомУчетЕд) Тогда
			
			ТекстОшибки = "Укажите идентиф. номер учетной единицы";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "СведенияГосСистем", СтрГосСист.НомерСтроки, 
				"ИдНомУчетЕд", КатегорияОшибка, ТекстОшибки, "Указать");
				
		КонецЕсли;
		
	КонецЦикла;

	// проверим, что для одинаковых НаимГосСист реквизиты УчетЕд и ИнаяИнф должны совпадать
	тзСведенияГосСистем = Объект.СведенияГосСистем.Выгрузить();
	
	тзНаимГосСист = Объект.СведенияГосСистем.Выгрузить();
	тзНаимГосСист.Свернуть("НаимГосСист");
	
	тзНаимГосСистУчетЕдИнаяИнф = Объект.СведенияГосСистем.Выгрузить();
	тзНаимГосСистУчетЕдИнаяИнф.Свернуть("НаимГосСист, УчетЕд, ИнаяИнф");
	
	Для Каждого СтрНаимГосСист Из тзНаимГосСист Цикл
		
		КолвоГосСист = тзНаимГосСистУчетЕдИнаяИнф.НайтиСтроки(Новый Структура("НаимГосСист", СтрНаимГосСист.НаимГосСист)).Количество();			
		Если КолвоГосСист > 1 Тогда			
			
			НайдСтроки = тзСведенияГосСистем.НайтиСтроки(Новый Структура("НаимГосСист", СтрНаимГосСист.НаимГосСист));
			Если НайдСтроки.Количество() > 0 Тогда
				НомерСтроки = НайдСтроки[0].НомерСтроки;
			Иначе
				НомерСтроки = 0;
			КонецЕсли;
			
			ТекстОшибки = "Для системы " + СтрНаимГосСист.НаимГосСист + " реквизиты Учет ед и Иная инф должны совпадать";
			КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "СведенияГосСистем", НомерСтроки, 
				"НаимГосСист", КатегорияОшибка, ТекстОшибки, "Указать");
			
		КонецЕсли;
					
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьСквознойСценарий(Знач Объект, ТаблицаОшибок)
	
	КонтурЛогистика_ОбщегоНазначенияСервер.НачатьТранзакцию_();
	
	Попытка
		
		Если Не ЗначениеЗаполнено(Объект.ЛицоОформившееПЛ) Тогда
			Возврат;
		КонецЕсли;
		
		КатегорияОшибка = Перечисления.КонтурЛогистика_КатегорииОшибокОбъектов.Ошибка;
		
		// Титул 1
		Если ТипЗнч(Объект) = Тип("ДокументОбъект.КонтурЛогистика_ПЛ_Титул1_5_02") Тогда
			Объект.ДополнительныеСвойства.Вставить("ТихийРежим");	// Без лишних сообщений
			Объект.ДополнительныеСвойства.Вставить("ПроверкаСквозногоСценария");
			Объект.Записать();
		КонецЕсли;
		
		// Титул 2
		Если Объект.ФормироватьТ2Сразу Тогда
			
			ПредыдущиеТитулы = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);
			УточнениеТипаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02;
			ДополнительныеДанные = Новый Структура;
			ДополнительныеДанные.Вставить("Водитель", Объект.Водитель);
			ДополнительныеДанные.Вставить("ПроверкаЗаполнения");
			ДанныеЗаполнения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДополнительныеДанные);
			
			РезультатВвода = КонтурЛогистика_ОбработкаДокументовСервер.ВвестиСледующиеТитулыПоПереданнымПакетно(
				ПредыдущиеТитулы, УточнениеТипаЛогистика, Ложь, ДанныеЗаполнения);
			
			Если РезультатВвода.ВведенныеДокументы.Количество() > 0 Тогда
				ТаблицаОшибокТ2 = Неопределено;
				Титул2 = РезультатВвода.ВведенныеДокументы[0];
				Документы.КонтурЛогистика_ПЛ_Титул2_5_02.ПроверитьДокумент(Титул2, ТаблицаОшибокТ2);
				
				Для Каждого ТекущаяОшибка Из ТаблицаОшибокТ2 Цикл
					СтрокаОшибки = ТаблицаОшибок.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаОшибки, ТекущаяОшибка);
					СтрокаОшибки.ИмяПоля = "ДанныеТ2" + СтрокаОшибки.ИмяПоля;
				КонецЦикла;
				
				Если Не ЗначениеЗаполнено(Объект.ДанныеТ2ПользовательПодписант) Тогда
					ТекстОшибки = "Укажите Пользователь подписант для Медосмотра";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
						"ДанныеТ2ПользовательПодписант", КатегорияОшибка, ТекстОшибки, "Указать");
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		// Титул 3
		Если Объект.ФормироватьТ3Сразу Тогда
			
			ПредыдущиеТитулы = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(Объект.Ссылка);
			УточнениеТипаЛогистика = Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02;
			ДополнительныеДанные = Новый Структура;
			ДополнительныеДанные.Вставить("ПроверкаЗаполнения");
			ДанныеЗаполнения = КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЗначениеВМассиве(ДополнительныеДанные);
			
			РезультатВвода = КонтурЛогистика_ОбработкаДокументовСервер.ВвестиСледующиеТитулыПоПереданнымПакетно(
				ПредыдущиеТитулы, УточнениеТипаЛогистика, Ложь, ДанныеЗаполнения);
			
			Если РезультатВвода.ВведенныеДокументы.Количество() > 0 Тогда
				ТаблицаОшибокТ3 = Неопределено;
				Титул3 = РезультатВвода.ВведенныеДокументы[0];
				Документы.КонтурЛогистика_ПЛ_Титул3_5_02.ПроверитьДокумент(Титул3, ТаблицаОшибокТ3,, Истина);
				
				Для Каждого ТекущаяОшибка Из ТаблицаОшибокТ3 Цикл
					СтрокаОшибки = ТаблицаОшибок.Добавить();
					ЗаполнитьЗначенияСвойств(СтрокаОшибки, ТекущаяОшибка);
					СтрокаОшибки.ИмяПоля = "ДанныеТ3" + СтрокаОшибки.ИмяПоля;
				КонецЦикла;
				
				Если Не ЗначениеЗаполнено(Объект.ДанныеТ3ПользовательПодписант) Тогда
					ТекстОшибки = "Укажите Пользователь подписант для Тех контроль";
					КонтурЛогистика_ПанельОшибокСервер.ДобавитьВТаблицуОшибок(ТаблицаОшибок, "", "",
						"ДанныеТ3ПользовательПодписант", КатегорияОшибка, ТекстОшибки, "Указать");
				КонецЕсли;
			КонецЕсли;
			
		КонецЕсли;
		
		// Так как нам надо отменить изменения сделанные при валидации
		ОтменитьТранзакцию();
		
	Исключение
		ОтменитьТранзакцию();
		ВызватьИсключение;
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти

#Область НастройкиКонвертацииДокументов

Функция МассивУсловноОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	МассивОбязательных.Добавить("ОрганизацияМедик");
		
	МассивОбязательных.Добавить("Прицеп");
	МассивОбязательных.Добавить("Прицеп2");	
	МассивОбязательных.Добавить("СрокПЛИнтервал");
	МассивОбязательных.Добавить("Водитель2");
	МассивОбязательных.Добавить("ВидКоммерческойПеревозки");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивУсловноОбязательныхРеквизитовТЧ() Экспорт
	
	МассивОбязательных = Новый Массив();
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивОбязательныхРеквизитов() Экспорт
	
	МассивОбязательных = Новый Массив();
	МассивОбязательных.Добавить("ЛицоОформившееПЛ");
	МассивОбязательных.Добавить("ВидПеревозки");
	МассивОбязательных.Добавить("ВидСообщения");
	МассивОбязательных.Добавить("СрокПЛ");
	МассивОбязательных.Добавить("ТранспортноеСредство");
	МассивОбязательных.Добавить("Водитель");
	
	МассивОбязательных.Добавить("ПользовательПодписант");
	
	Возврат МассивОбязательных;
	
КонецФункции

Функция МассивДополнительныхРеквизитов() Экспорт
	
	МассивДополнительных = Новый Массив();
			
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"ДополнительныеВодителиМассивСтруктур",
		"Дополнительные водители",
		"Указываются, если а/м управляют несколько водителей",
		"МассивСтруктур(см. таблицу ДополнительныеВодители)",
		2));
	 	
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"ДополнительныеПолучателиФайлаМассивСтруктур",
		"Дополнительные получатели файла",
		"Указываются дополнительные получатели файла",
		"МассивСтруктур(см. таблицу ДополнительныеПолучателиФайла)",
		2));
		
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"СведенияГосСистемМассивСтруктур",
		"Сведения гос систем",
		"Дополнительные сведения о товаре, подлежащем идентификации и учету в государственной информационной системе",
		"МассивСтруктур(см. таблицу СведенияГосСистем)",
		2));
		
	МассивДополнительных.Добавить(ДопРеквизитСтруктура(
		"СпецУслДвижМассивСтруктур",
		"Специальные условия движения",
		"Сведения о специальных условиях движения",
		"МассивСтруктур(см. таблицу СпецУслДвиж)",
		2));
	
	Возврат МассивДополнительных;
	
КонецФункции

Функция КлючевыеРеквизитыСАвтоматическимЗаполнением() Экспорт
	
	МассивКлючевых = Новый Массив();
	
	МассивКлючевых.Добавить("УИД_ПЛ");
	МассивКлючевых.Добавить("СпосПодтПолном");
	МассивКлючевых.Добавить("ТипПодпис");
	МассивКлючевых.Добавить("Должность");
	МассивКлючевых.Добавить("Фамилия");
	МассивКлючевых.Добавить("Имя");
	МассивКлючевых.Добавить("Отчество");
	МассивКлючевых.Добавить("kl_id");
	
	МассивКлючевых.Добавить("ДатИнфСоб");
	МассивКлючевых.Добавить("ВрИнфСоб");
			
	Возврат МассивКлючевых;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СинонимРеквизита(ИмяРеквизита) Экспорт

	Попытка
	
		Возврат Метаданные.Документы.КонтурЛогистика_ПЛ_Титул1_5_02.Реквизиты[ИмяРеквизита].Синоним;
	
	Исключение
		
		//TODO метрику
		Возврат ИмяРеквизита;
		
	КонецПопытки;

КонецФункции

Функция ДопРеквизитСтруктура(Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс)
	Возврат Новый Структура("Имя, Синоним, Комментарий, Тип, Картинка", Имя, Синоним, Комментарий, ТипЗначения, КартинкаИндекс);	
КонецФункции

Функция ПолучитьСледующийПоЦепочкеТипТитулаПЛ(ДокПЛТ1Ссылка) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если Не ЗначениеЗаполнено(ДокПЛТ1Ссылка) Тогда 
		ВызватьИсключение "Не заполнен Документ - не могу определить титул";
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02) КАК ТипТитула
	               |ПОМЕСТИТЬ ВТ_ВсеТитулыПЛ
	               |ИЗ
	               |	Документ.КонтурЛогистика_ПЛ_Титул1_5_02 КАК КонтурЛогистика_ПЛ_Титул1
	               |ГДЕ
	               |	КонтурЛогистика_ПЛ_Титул1.Ссылка = &ДокументПЛТ1
	               |	И НЕ КонтурЛогистика_ПЛ_Титул1.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул3_5_02)
	               |ИЗ
	               |	Документ.КонтурЛогистика_ПЛ_Титул2_5_02 КАК КонтурЛогистика_ПЛ_Титул2
	               |ГДЕ
	               |	КонтурЛогистика_ПЛ_Титул2.Титул1 = &ДокументПЛТ1
	               |	И НЕ КонтурЛогистика_ПЛ_Титул2.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул4_5_02)
	               |ИЗ
	               |	Документ.КонтурЛогистика_ПЛ_Титул3_5_02 КАК КонтурЛогистика_ПЛ_Титул3
	               |ГДЕ
	               |	КонтурЛогистика_ПЛ_Титул3.Титул1 = &ДокументПЛТ1
	               |	И НЕ КонтурЛогистика_ПЛ_Титул3.ПометкаУдаления
	               |
	               |ОБЪЕДИНИТЬ ВСЕ
	               |
	               |ВЫБРАТЬ
	               |	ЗНАЧЕНИЕ(Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул5_5_02)
	               |ИЗ
	               |	Документ.КонтурЛогистика_ПЛ_Титул4_5_02 КАК КонтурЛогистика_ПЛ_Титул4
	               |ГДЕ
	               |	КонтурЛогистика_ПЛ_Титул4.Титул1 = &ДокументПЛТ1
	               |	И НЕ КонтурЛогистика_ПЛ_Титул4.ПометкаУдаления
	               |	              
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВсеТитулыЭТРН.ТипТитула КАК ТипТитула
	               |ИЗ
	               |	ВТ_ВсеТитулыПЛ КАК ВТ_ВсеТитулыЭТРН
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ_ВсеТитулыЭТРН.ТипТитула.Порядок УБЫВ";
	
	Запрос.УстановитьПараметр("ДокументПЛТ1", ДокПЛТ1Ссылка);
	
	Результат = Запрос.Выполнить();
	Выборка = Результат.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		Возврат Выборка.ТипТитула;
	Иначе
		Возврат Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул1_5_02;
	КонецЕсли;
	
КонецФункции

#КонецОбласти

#КонецЕсли
